package lesson_23;/* Group: 52-1, "AIT Hi-tech team" GMBH 
Author: Bogdan Fesenko
Date: 14-10-2024
*/

/*
Абстракция — это один из ключевых принципов объектно-ориентированного программирования (ООП), который помогает
упростить сложные системы, скрывая ненужные детали и показывая только важные характеристики объекта.
Цель абстракции — уменьшить сложность кода и сделать его более понятным и удобным для использования.

Пример в реальной жизни: представь, что ты водишь автомобиль. Ты не обязательно знаешь, как работает двигатель
или как передается крутящий момент на колеса. Тебе важно только то, что у автомобиля есть руль, педали газа и тормоза,
которыми ты управляешь. Все сложные детали работы автомобиля "скрыты" — это и есть пример абстракции.

В Java абстракция реализуется через абстрактные классы и интерфейсы. Эти структуры позволяют разработчику определить
общие методы и свойства, не вдаваясь в подробности их реализации.
 */
public class Task_1 {
    public static void main(String[] args) {


    }

}
